Merge branch 'main' into feat/visual-studio-install-support
